Revit 2027 API
AppearanceAssetElement.GetRenderingAsset Method
 Gets the rendering asset for the appearance asset element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Asset GetRenderingAsset()
Public Function GetRenderingAsset As Asset
public:
Asset^ GetRenderingAsset()
member GetRenderingAsset : unit -> Asset
Return Value
Asset
 The rendering asset held by this appearance asset element.
Remarks
 The retrieved Asset may be empty if it is loaded from material library without any modification. In this case, you can use Application.GetAssets(AssetType.Appearance) to load all preset appearance assets, and retrieve the asset by its name.
See Also
Reference
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace